---
kind: property
id: P:Autodesk.Revit.DB.DocumentSet.Size
source: html/527ac2b7-77c4-2fe2-fc07-22b19ef92ba2.htm
---
# Autodesk.Revit.DB.DocumentSet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```